// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

// let tripod = [1,2,3,4,5,"a","b","q","e","f", true, false, true, false, true]
// for (let item of tripod){
//     console.log(item)
// }


// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// let main = [1,2,3,4,5, true, false, true, false, true, "s", "d", "a", "w"]
//
// for (let i = 0; i < main.length; i++) {
//     console.log(main[i]);
// }

// - є масив [2,17,13,6,22,31,45,66,100,-18] :
// 1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// 1. перебрати його циклом while

// let main = [2,17,13,6,22,31,45,66,100,-18]
// let i = 0
// while (i < main.length){
//     console.log(main[i]);
//     i++;
// }

// 2. перебрати його циклом for

// let main = [2,17,13,6,22,31,45,66,100,-18]
//
// for (let i = 0; i < main.length; i++){
//     console.log(main[i]);
// }

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

// let main = [2,17,13,6,22,31,45,66,100,-18]
// let i = 1;
//
// while (i < main.length) {
//     console.log(main[i]);
//     i += 2;
// }

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// let main = [2,17,13,6,22,31,45,66,100,-18]
//
// for (let i = 1; i < main.length; i +=2){
//     console.log(main[i]);
// }

// 5. перебрати циклом while та вивести  числа тільки парні  значення

// let main = [2,17,13,6,22,31,45,66,100,-18]
//
// let i = 0;
// while  ( i < main.length) {
//
//     if (main[i] %2 === 0){
//         console.log(main[i])
//     }
//         i++;
// }

// 6. перебрати циклом for та вивести  числа тільки парні  значення

// let main = [2,17,13,6,22,31,45,66,100,-18]
//
// for (let i = 0; i < main.length; i++) {
//         if (main[i] %2 === 0){
//         console.log(main[i])
//     }
// }

 // 7. замінити кожне число кратне 3 на слово "okten"
//
// let main = [2,17,13,6,22,31,45,66,100,-18]
//
// for (let item of main) {
//     if (item %3 === 0) {
//         console.log("Okten")
//     }
// }

// 8. вивести масив в зворотньому порядку.

// let main = [2,17,13,6,22,31,45,66,100,-18]
//
// for (let i = main.length -1; i > 0; i--) {
//     console.log(main[i])
// }

// let main = [2,17,13,6,22,31,45,66,100,-18]
// let i = main.length
// while (i > 0){
//     console.log(main[i]);
//     i--;
// }

// let main = [2,17,13,6,22,31,45,66,100,-18]
//
// for (let i = main.length; i > 0; i--){
//     console.log(main[i]);
// }

// let main = [2,17,13,6,22,31,45,66,100,-18]
// let i = 9;
//
// while (i > 0) {
//     console.log(main[i]);
//     i -= 2;
// }

// let main = [2,17,13,6,22,31,45,66,100,-18]
//
// for (let i = 9; i > 0; i -=2){
//     console.log(main[i]);
// }

// let main = [2,17,13,6,22,31,45,66,100,-18]
//
// let i = main.length;
// while  ( i > 0) {
//
//     if (main[i] %2 === 0){
//         console.log(main[i])
//     }
//         i--;
// }

// let main = [2,17,13,6,22,31,45,66,100,-18]
//
// for (let i = main.length; i > 0; i--) {
//         if (main[i] %2 === 0){
//         console.log(main[i])
//     }
// }

// let main = [2,17,13,6,22,31,45,66,100,-18]
//
// for (let i = main.length; i > 0; i--) {
//     if (main[i] %3 === 0) {
//         console.log("Okten")
//     }
// }

