// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
    // Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends =
//     ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if ( friends.length >= 3){
//
//
// console.log("Великий масив, в якому  3 і більше елементи.")
// } else {
//     console.log("Це маленький масив, в якому менше 3-х елементів.")
// }

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.


//
// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
//
// let result = "";
// let a = 0;
// let b = 10;
//
// let answer = ( a + b < 4) ? result = "Мало" : result = "багато"
//
// console.log(answer)


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
//
// let number = 0;
// (number === 0) ? console.log("0") : (number < 0) ? console.log("-0") : (number > 0) ? console.log("+0") : console.log("ERROR")


// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = "";
//
// (test) ? console.log('Вірно') : (!test) ? console.log('Неправильно') : console.log("ERROR")


// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let user = prompt("Яка «офіційна» назва JavaScript?")
// if (user === "ECMAScript") {
//     console.log("Правильно!")
// } else {
//     console.log("Не знаєте? ECMAScript!")
// }

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let user = +prompt()
// if (user > 1 && user < 21) {
//     console.log("1/3")
// }else if (user > 20 && user < 49) {
//     console.log("2/3")
// }else if (user > 48 && user < 90) {
//     console.log("3/3")
// }else {
//     console.log("ERROR")
// }


// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let num = 10
// if (num === 10) {
//     console.log("ВІРНО")
// } else {
//     console.log("НЕВІРНО")
// }


// Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let stud = prompt("чи ми йдемо сьогодні в OKTEN на навчання?")
// if (stud > 9 && stud < 23) {
//     console.log("ми йдемо ВЧИТИСЯ")
// } else {
//     console.log("сидимо вдома і вчимося ОНЛАЙН")
// }

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ...
//

// let vic = 1;
// switch (vic) {
//     case 1:
//         console.log("Авто")
//         break;
//     case 2:
//         console.log("Мото")
//         break;
//     case 3:
//         console.log("Телефон")
//         break;
//     case 4:
//         console.log("Дiфка")
//         break;
//     case 5:
//         console.log("Хлопець")
//         break;
//     default:
//         console.log("Error")
// }


